In [1]:
import pandas as pd
import numpy as np
import altair as alt
import matplotlib.pyplot as plt

In [24]:
apts = pd.read_csv('data/apts_2025_raw.csv')

In [25]:
apts.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1080 entries, 0 to 1079
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   price         1080 non-null   int64
 1   bedrooms      1080 non-null   int64
 2   dwell_type    1080 non-null   object
 3   street        1080 non-null   object
 4   neighborhood  1077 non-null   object
 5   furniture     1080 non-null   object
 6   title         1080 non-null   object
 7   square_feet   1080 non-null   int64
 8   cityname      1080 non-null   object
 9   state         1080 non-null   object
dtypes: int64(3), object(7)
memory usage: 84.5+ KB

In [26]:
apts.describe()

             price     bedrooms  square_feet
count  1080.000000  1080.000000  1080.000000
mean    929.378704     1.357407   816.514815
std     273.779198     0.585618   844.996585
min     400.000000     1.000000   150.000000
25%     750.000000     1.000000   550.000000
50%     845.000000     1.000000   675.000000
75%    1000.000000     2.000000   850.000000
max    1950.000000     5.000000  9999.000000

In [29]:
apts_clean = apts[apts.duplicated(subset=['title', 'street'], keep=False)]

In [30]:
apts_clean.describe()

             price    bedrooms  square_feet
count   610.000000  610.000000   610.000000
mean    895.181967    1.240984   852.477049
std     222.934809    0.536937   985.757457
min     451.000000    1.000000   150.000000
25%     750.000000    1.000000   552.000000
50%     825.000000    1.000000   650.000000
75%    1000.000000    1.000000   825.000000
max    1475.000000    5.000000  9999.000000

In [31]:
apts_clean[apts_clean['square_feet'] == 9999]

,price,bedrooms,dwell_type,street,neighborhood,furniture,title,square_feet,cityname,state
246,1375,1,Apartment,"252 n 5th ave floor 2, manville, nj 08835",Manville,Unfurnished,"252 n 5th ave floor 2, manville, nj 08835$1,37...",9999,manville,NJ
256,1475,1,Apartment,"158 alexander st, newark, nj 07106",Lower Vailsburg,Unfurnished,"158 alexander st, newark, nj 07106$1,475/mo1 b...",9999,newark,NJ
266,1375,1,Apartment,"252 n 5th ave floor 2, manville, nj 08835",Manville,Unfurnished,"252 n 5th ave floor 2, manville, nj 08835$1,37...",9999,manville,NJ
276,1475,1,Apartment,"158 alexander st, newark, nj 07106",Lower Vailsburg,Unfurnished,"158 alexander st, newark, nj 07106$1,475/mo1 b...",9999,newark,NJ